#+title: One Seven

** Theorem
If A and B are symmetric matrcies with the same size, and if k is any scalar, then;
- A^T is symmetric
- A+B and A-B are symmetric
- kA is symmetric

The product of two symmetric matricies is symmetric iff the matricies commute (AB = BA)
$\begin{bmatrix}1&2\\2&3\end{bmatrix}\begin{bmatrix}-4&1\\1&0\end{bmatrix} = \begin{bmatrix}-2&1\\-5&2\end{bmatrix}$
$\begin{bmatrix}1&2\\2&3\end{bmatrix}\begin{bmatrix}-4&3\\3&-1\end{bmatrix} = \begin{bmatrix}2&1\\1&3\end{bmatrix}$
This guy is symmetric, because AB in this case commute, meaning BA would give the same results
#+begin_src octave
a = [1,2;2,3]
b = [-4,3;3,-1]

a * b == b * a
#+end_src

#+RESULTS:
| 1 | 1 |
| 1 | 1 |

